Revit 2027 API
IConnector Interface
An interface which provides access to connector in Autodesk Revit MEP document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IConnector
Public Interface IConnector
public interface class IConnector
type IConnector = interface end
The IConnector type exposes the following members.
Properties
Name | Description
CoordinateSystem | The coordinate system of the connector.
Domain | The domain of the connector.
Height | The height of the connector.
Origin | The location of the connector in family document.
Radius | The radius of the connector.
Shape | The shape of the connector.
Width | The width of the connector.
Top
Remarks
This interface is shared by Connector, ConnectorElement.
See Also
Reference
Autodesk.Revit.DB Namespace